tutorials/incompressible/channelFoam/channel395/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    topWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    sides1
    {
        type            cyclic;
    }

    sides2
    {
        type            cyclic;
    }

    inout1
    {
        type            cyclic;
    }

    inout2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
